synthlab_2000-api/app/controllers/presets_controller.rb

SELECT "presets".* FROM "presets"
---
  def index
    @presets = Preset.all

INSERT INTO "presets" ("reverb", "delay", "tremolo", "waveshape", "envelope", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["reverb", "234"], ["delay", "234"], ["tremolo", "234"], ["waveshape", "234"], ["envelope", "234"], ["created_at", "2021-04-14 20:04:31.985290"], ["updated_at", "2021-04-14 20:04:31.985290"]]
---
  def create
    @preset = Preset.new(preset_params)

    if @preset.save